fmuller-pns/esp32-vscode-project-template/sdkconfig.defaults
# esp32 , esp32s3, esp32c6
CONFIG_IDF_TARGET="esp32s3"